Revit 2026 API

# ConduitSizeSettingsGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyValuePair<string, ConduitSizes>> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of String, ConduitSizes))
```
```cpp
public:
virtual IEnumerator<KeyValuePair<String^, ConduitSizes^>>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<string, ConduitSizes>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<string, ConduitSizes>>
```

#### Return Value

IEnumeratorKeyValuePairString, ConduitSizesAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ConduitSizeSettings Class

Autodesk.Revit.DB.Electrical Namespace